/*********************************************************************************************************************
* @file            main.c
* @brief           干簧管例程
* @author          Fantastic Potato
* @version         1.0
* @Target core     CH32V307VCT6
* @date            2022-3-2
* 干簧管检测到磁铁时，点亮小车尾灯
********************************************************************************************************************/

/* 用户头文件 */
#include "main.h"
#include "headfile.h"

/* 全局变量声明 */

/* 主函数 */
int main(void)
{
    /* 此处声明需要用到的局部变量 */

    /* 智能车初始化 */
    car_init();

    /* 此处编写单次运行的代码(例如：初始化代码等) */


    while(1)
    {
        /* 此处编写需要循环执行的代码 */
        reed_check();
        if(g_reed_flag == 1)
        {
            car_both_rgb_on(red);
            Delay_Ms(10);
        }
        else
        {
            car_both_rgb_off();
            Delay_Ms(10);
        }
    }
}





